HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG1OUT0_SEL1_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG1OUT0_SEL1_OFF (4)

/** \\brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG1OUT0_SEL2_LEN (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG1OUT0_SEL2_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG1OUT0_SEL2_OFF (8)

/** \\brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG1OUT0_SEL3_LEN (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG1OUT0_SEL3_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG1OUT0_SEL3_OFF (12)

/** \\brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG1OUT0_SEL4_LEN (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG1OUT0_SEL4_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG1OUT0_SEL4_OFF (16)

/** \\brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG1OUT0_SEL5_LEN (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG1OUT0_SEL5_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG1OUT0_SEL5_OFF (20)

/** \\brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG1OUT0_SEL6_LEN (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG1OUT0_SEL6_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG1OUT0_SEL6_OFF (24)

/** \\brief  Length for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG1OUT0_SEL7_LEN (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG1OUT0_SEL7_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG1OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG1OUT0_SEL7_OFF (28)

/** \\brief  Length for Ifx_GTM_ADCTRIG1OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG1OUT1_SEL0_LEN (4)

/** \\brief  Mask for Ifx_GTM_ADCTRIG1OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG1OUT1_SEL0_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_ADCTRIG1OUT1_Bits.SEL0 */
#define IFX_GTM_ADCTRIG1OUT1_SEL0_OFF (0)

/** \\brief  Length for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_ADDR */
#define IFX_GTM_AEI_ADDR_XPT_TO_ADDR_LEN (20)

/** \\brief  Mask for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_ADDR */
#define IFX_GTM_AEI_ADDR_XPT_TO_ADDR_MSK (0xfffff)

/** \\brief  Offset for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_ADDR */
#define IFX_GTM_AEI_ADDR_XPT_TO_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_W1R0 */
#define IFX_GTM_AEI_ADDR_XPT_TO_W1R0_LEN (1)

/** \\brief  Mask for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_W1R0 */
#define IFX_GTM_AEI_ADDR_XPT_TO_W1R0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_AEI_ADDR_XPT_Bits.TO_W1R0 */
#define IFX_GTM_AEI_ADDR_XPT_TO_W1R0_OFF (20)

/** \\brief  Length for Ifx_GTM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_AFD_CH_BUF_ACC_DATA_LEN (29)

/** \\brief  Mask for Ifx_GTM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_AFD_CH_BUF_ACC_DATA_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_GTM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_AFD_CH_BUF_ACC_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_ARU_ACCESS_Bits.ADDR */
#define IFX_GTM_ARU_ARU_ACCESS_ADDR_LEN (9)

/** \\brief  Mask for Ifx_GTM_ARU_ARU_ACCESS_Bits.ADDR */
#define IFX_GTM_ARU_ARU_ACCESS_ADDR_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_ARU_ARU_ACCESS_Bits.ADDR */
#define IFX_GTM_ARU_ARU_ACCESS_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_ARU_ACCESS_Bits.RREQ */
#define IFX_GTM_ARU_ARU_ACCESS_RREQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_ARU_ACCESS_Bits.RREQ */
#define IFX_GTM_ARU_ARU_ACCESS_RREQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_ARU_ACCESS_Bits.RREQ */
#define IFX_GTM_ARU_ARU_ACCESS_RREQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ARU_ARU_ACCESS_Bits.WREQ */
#define IFX_GTM_ARU_ARU_ACCESS_WREQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ARU_ARU_ACCESS_Bits.WREQ */
#define IFX_GTM_ARU_ARU_ACCESS_WREQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ARU_ARU_ACCESS_Bits.WREQ */
#define IFX_GTM_ARU_ARU_ACCESS_WREQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ARU_DATA_H_Bits.DATA */
#define IFX_GTM_ARU_DATA_H_DATA_LEN (29)

/** \\brief  Mask for Ifx_GTM_ARU_DATA_H_Bits.DATA */
#define IFX_GTM_ARU_DATA_H_DATA_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_GTM_ARU_DATA_H_Bits.DATA */
#define IFX_GTM_ARU_DATA_H_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DATA_L_Bits.DATA */
#define IFX_GTM_ARU_DATA_L_DATA_LEN (29)

/** \\brief  Mask for Ifx_GTM_ARU_DATA_L_Bits.DATA */
#define IFX_GTM_ARU_DATA_L_DATA_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_GTM_ARU_DATA_L_Bits.DATA */
#define IFX_GTM_ARU_DATA_L_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DBG_ACCESS0_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS0_ADDR_LEN (9)

/** \\brief  Mask for Ifx_GTM_ARU_DBG_ACCESS0_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS0_ADDR_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_ARU_DBG_ACCESS0_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS0_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DBG_ACCESS1_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS1_ADDR_LEN (9)

/** \\brief  Mask for Ifx_GTM_ARU_DBG_ACCESS1_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS1_ADDR_MSK (0x1ff)

/** \\brief  Offset for Ifx_GTM_ARU_DBG_ACCESS1_Bits.ADDR */
#define IFX_GTM_ARU_DBG_ACCESS1_ADDR_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DBG_DATA0_H_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_H_DATA_LEN (29)

/** \\brief  Mask for Ifx_GTM_ARU_DBG_DATA0_H_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_H_DATA_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_GTM_ARU_DBG_DATA0_H_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_H_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DBG_DATA0_L_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_L_DATA_LEN (29)

/** \\brief  Mask for Ifx_GTM_ARU_DBG_DATA0_L_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_L_DATA_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_GTM_ARU_DBG_DATA0_L_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA0_L_DATA_OFF (0)

/** \\brief  Length for Ifx_GTM_ARU_DBG_DATA1_H_Bits.DATA */
#define IFX_GTM_ARU_DBG_DATA1_H_DATA_LEN (29)

