HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN10 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN10 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN10_OFF (11)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN11 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN11_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN11 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN11 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN11_OFF (12)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN1 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN1_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN1 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN1 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN1_OFF (2)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN2 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN2_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN2 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN2 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN2_OFF (3)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN3 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN3_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN3 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN3 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN3_OFF (4)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN4 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN4_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN4 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN4 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN4_OFF (5)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN5 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN5_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN5 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN5 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN5_OFF (6)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN6 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN6_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN6 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN6 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN6_OFF (7)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN7 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN7_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN7 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN7 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN7_OFF (8)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN8 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN8_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN8 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN8_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN8 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN8_OFF (9)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN9 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN9_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN9 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN9_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN9 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN9_OFF (10)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DEST_ERR */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DEST_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DEST_ERR */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DEST_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DEST_ERR */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DEST_ERR_OFF (0)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID0 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID0_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID0 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID0 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID0_OFF (1)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID10 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID10_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID10 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID10_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID10 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID10_OFF (11)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID11 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID11_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID11 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID11_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID11 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID11_OFF (12)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID1 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID1_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID1 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID1 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID1_OFF (2)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID2 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID2_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID2 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID2 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID2_OFF (3)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID3 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID3_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID3 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID3 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID3_OFF (4)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID4 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID4_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID4 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID4 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID4_OFF (5)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID5 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID5_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID5 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID5 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID5_OFF (6)

/** \\brief  Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID6 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID6_LEN (1)

/** \\brief  Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID6 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID6_MSK (0x1)

