HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_DPLL_APS_1C3_Bits.APS_1C3 */
#define IFX_GTM_DPLL_APS_1C3_APS_1C3_OFF (2)

/** \\brief  Length for Ifx_GTM_DPLL_APS_Bits.APS_1C2 */
#define IFX_GTM_DPLL_APS_APS_1C2_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_Bits.APS_1C2 */
#define IFX_GTM_DPLL_APS_APS_1C2_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_Bits.APS_1C2 */
#define IFX_GTM_DPLL_APS_APS_1C2_OFF (14)

/** \\brief  Length for Ifx_GTM_DPLL_APS_Bits.APS */
#define IFX_GTM_DPLL_APS_APS_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_Bits.APS */
#define IFX_GTM_DPLL_APS_APS_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_Bits.APS */
#define IFX_GTM_DPLL_APS_APS_OFF (2)

/** \\brief  Length for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_EXT_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_EXT_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_EXT_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_OLD */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_OLD_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_OLD */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_OLD_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_OLD */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_OLD_OFF (14)

/** \\brief  Length for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_STATUS */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_STATUS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_STATUS */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_STATUS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_STATUS */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_STATUS_OFF (6)

/** \\brief  Length for Ifx_GTM_DPLL_APS_Bits.WAPS_1C2 */
#define IFX_GTM_DPLL_APS_WAPS_1C2_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_Bits.WAPS_1C2 */
#define IFX_GTM_DPLL_APS_WAPS_1C2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_Bits.WAPS_1C2 */
#define IFX_GTM_DPLL_APS_WAPS_1C2_OFF (13)

/** \\brief  Length for Ifx_GTM_DPLL_APS_Bits.WAPS */
#define IFX_GTM_DPLL_APS_WAPS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APS_Bits.WAPS */
#define IFX_GTM_DPLL_APS_WAPS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APS_Bits.WAPS */
#define IFX_GTM_DPLL_APS_WAPS_OFF (1)

/** \\brief  Length for Ifx_GTM_DPLL_APT_2C_Bits.APT_2C */
#define IFX_GTM_DPLL_APT_2C_APT_2C_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_2C_Bits.APT_2C */
#define IFX_GTM_DPLL_APT_2C_APT_2C_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_2C_Bits.APT_2C */
#define IFX_GTM_DPLL_APT_2C_APT_2C_OFF (2)

/** \\brief  Length for Ifx_GTM_DPLL_APT_Bits.APT_2B */
#define IFX_GTM_DPLL_APT_APT_2B_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_Bits.APT_2B */
#define IFX_GTM_DPLL_APT_APT_2B_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_Bits.APT_2B */
#define IFX_GTM_DPLL_APT_APT_2B_OFF (14)

/** \\brief  Length for Ifx_GTM_DPLL_APT_Bits.APT */
#define IFX_GTM_DPLL_APT_APT_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_Bits.APT */
#define IFX_GTM_DPLL_APT_APT_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_Bits.APT */
#define IFX_GTM_DPLL_APT_APT_OFF (2)

/** \\brief  Length for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_EXT */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_EXT_LEN (6)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_EXT */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_EXT_MSK (0x3f)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_EXT */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_EXT_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_OLD */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_OLD_LEN (10)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_OLD */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_OLD_MSK (0x3ff)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_OLD */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_OLD_OFF (14)

/** \\brief  Length for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_STATUS */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_STATUS_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_STATUS */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_STATUS_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_STATUS */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_STATUS_OFF (6)

/** \\brief  Length for Ifx_GTM_DPLL_APT_Bits.WAPT_2B */
#define IFX_GTM_DPLL_APT_WAPT_2B_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_Bits.WAPT_2B */
#define IFX_GTM_DPLL_APT_WAPT_2B_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_Bits.WAPT_2B */
#define IFX_GTM_DPLL_APT_WAPT_2B_OFF (13)

/** \\brief  Length for Ifx_GTM_DPLL_APT_Bits.WAPT */
#define IFX_GTM_DPLL_APT_WAPT_LEN (1)

/** \\brief  Mask for Ifx_GTM_DPLL_APT_Bits.WAPT */
#define IFX_GTM_DPLL_APT_WAPT_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_DPLL_APT_Bits.WAPT */
#define IFX_GTM_DPLL_APT_WAPT_OFF (1)

/** \\brief  Length for Ifx_GTM_DPLL_CDT_SX_Bits.CDT_SX */
#define IFX_GTM_DPLL_CDT_SX_CDT_SX_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_CDT_SX_Bits.CDT_SX */
#define IFX_GTM_DPLL_CDT_SX_CDT_SX_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_CDT_SX_Bits.CDT_SX */
#define IFX_GTM_DPLL_CDT_SX_CDT_SX_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_CDT_SX_NOM_Bits.CDT_SX_NOM */
#define IFX_GTM_DPLL_CDT_SX_NOM_CDT_SX_NOM_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_CDT_SX_NOM_Bits.CDT_SX_NOM */
#define IFX_GTM_DPLL_CDT_SX_NOM_CDT_SX_NOM_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_CDT_SX_NOM_Bits.CDT_SX_NOM */
#define IFX_GTM_DPLL_CDT_SX_NOM_CDT_SX_NOM_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_CDT_TX_Bits.CDT_TX */
#define IFX_GTM_DPLL_CDT_TX_CDT_TX_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_CDT_TX_Bits.CDT_TX */
#define IFX_GTM_DPLL_CDT_TX_CDT_TX_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_CDT_TX_Bits.CDT_TX */
#define IFX_GTM_DPLL_CDT_TX_CDT_TX_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_CDT_TX_NOM_Bits.CDT_TX_NOM */
#define IFX_GTM_DPLL_CDT_TX_NOM_CDT_TX_NOM_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_CDT_TX_NOM_Bits.CDT_TX_NOM */
#define IFX_GTM_DPLL_CDT_TX_NOM_CDT_TX_NOM_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_DPLL_CDT_TX_NOM_Bits.CDT_TX_NOM */
#define IFX_GTM_DPLL_CDT_TX_NOM_CDT_TX_NOM_OFF (0)

/** \\brief  Length for Ifx_GTM_DPLL_CNT_NUM1_Bits.CNT_NUM_1 */
#define IFX_GTM_DPLL_CNT_NUM1_CNT_NUM_1_LEN (24)

/** \\brief  Mask for Ifx_GTM_DPLL_CNT_NUM1_Bits.CNT_NUM_1 */
#define IFX_GTM_DPLL_CNT_NUM1_CNT_NUM_1_MSK (0xffffff)

