HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GL2I_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GL2I_IRQ_OFF (16)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GLI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GLI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GLI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GLI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_GLI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_GLI_IRQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LL2I_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LL2I_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LL2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LL2I_IRQ_OFF (17)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LLI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LLI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LLI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LLI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_LLI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_LLI_IRQ_OFF (14)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MSI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MSI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MSI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MSI_IRQ_OFF (6)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MTI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MTI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_MTI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_MTI_IRQ_OFF (7)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_PWI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_PWI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_PWI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_PWI_IRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SAS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SAS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SAS_IRQ_OFF (8)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SIS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SIS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SIS_IRQ_OFF (4)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SORI_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SORI_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_SORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_SORI_IRQ_OFF (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAS_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAS_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAS_IRQ_OFF (9)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAX_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAX_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAX_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAX_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAX_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAX_IRQ_OFF (3)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0_IRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIN_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIN_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIN_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIN_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIN_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIN_IRQ_OFF (2)

