HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH2_IRQ_OFF (18)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH3_IRQ_OFF (19)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH4_IRQ_OFF (20)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH5_IRQ_OFF (21)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH6_IRQ_OFF (22)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS2_CH7_IRQ_OFF (23)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH0_IRQ_OFF (24)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH1_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH1_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH1_IRQ_OFF (25)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH2_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH2_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH2_IRQ_OFF (26)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH3_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH3_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH3_IRQ_OFF (27)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH4_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH4_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH4_IRQ_OFF (28)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH5_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH5_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH5_IRQ_OFF (29)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH6_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH6_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH6_IRQ_OFF (30)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH7_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH7_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS3_CH7_IRQ_OFF (31)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH0_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH0_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH0_IRQ_OFF (0)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH10_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH10_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH10_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH10_IRQ_OFF (10)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH11_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH11_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH11_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH11_IRQ_OFF (11)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH12_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH12_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH12_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH12_IRQ_OFF (12)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH13_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH13_IRQ_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH13_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH13_IRQ_OFF (13)

/** \\brief  Length for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH14_IRQ_LEN (1)

/** \\brief  Mask for Ifx_GTM_ICM_IRQG_6_Bits.TOM0_CH14_IRQ */
#define IFX_GTM_ICM_IRQG_6_TOM0_CH14_IRQ_MSK (0x1)

