HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS201 */
#define IFX_GTM_MCSINTSTAT_MCS201_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS201 */
#define IFX_GTM_MCSINTSTAT_MCS201_OFF (9)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS210 */
#define IFX_GTM_MCSINTSTAT_MCS210_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS210 */
#define IFX_GTM_MCSINTSTAT_MCS210_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS210 */
#define IFX_GTM_MCSINTSTAT_MCS210_OFF (10)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS211 */
#define IFX_GTM_MCSINTSTAT_MCS211_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS211 */
#define IFX_GTM_MCSINTSTAT_MCS211_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS211 */
#define IFX_GTM_MCSINTSTAT_MCS211_OFF (11)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS300 */
#define IFX_GTM_MCSINTSTAT_MCS300_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS300 */
#define IFX_GTM_MCSINTSTAT_MCS300_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS300 */
#define IFX_GTM_MCSINTSTAT_MCS300_OFF (12)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS301 */
#define IFX_GTM_MCSINTSTAT_MCS301_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS301 */
#define IFX_GTM_MCSINTSTAT_MCS301_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS301 */
#define IFX_GTM_MCSINTSTAT_MCS301_OFF (13)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS310 */
#define IFX_GTM_MCSINTSTAT_MCS310_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS310 */
#define IFX_GTM_MCSINTSTAT_MCS310_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS310 */
#define IFX_GTM_MCSINTSTAT_MCS310_OFF (14)

/** \\brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS311 */
#define IFX_GTM_MCSINTSTAT_MCS311_LEN (1)

/** \\brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS311 */
#define IFX_GTM_MCSINTSTAT_MCS311_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS311 */
#define IFX_GTM_MCSINTSTAT_MCS311_OFF (15)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_0_OFF (0)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_1_OFF (1)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_2_OFF (2)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_3_OFF (3)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_4_OFF (4)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_5_OFF (5)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_6_OFF (6)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_0_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_0_7_OFF (7)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_0_OFF (8)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_1_OFF (9)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_2_OFF (10)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_3_OFF (11)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_4_MSK (0x1)

