HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_4_OFF (12)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_5_OFF (13)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_6_OFF (14)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_1_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_1_7_OFF (15)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_0_OFF (16)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_1_OFF (17)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_2_OFF (18)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_3_OFF (19)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_4_OFF (20)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_5_OFF (21)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_6_OFF (22)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_2_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_2_7_OFF (23)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_0 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_0_OFF (24)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_1 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_1_OFF (25)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_2 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_2_OFF (26)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_3 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_3_OFF (27)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_4 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_4_OFF (28)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_5 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_5_OFF (29)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_6_MSK (0x1)

