HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxGtm_bf.h
/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_6 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_6_OFF (30)

/** \\brief  Length for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_ACTIVITY_0_Bits.MCA_3_7 */
#define IFX_GTM_MON_ACTIVITY_0_MCA_3_7_OFF (31)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU0 */
#define IFX_GTM_MON_STATUS_ACT_CMU0_OFF (0)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU1 */
#define IFX_GTM_MON_STATUS_ACT_CMU1_OFF (1)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU2 */
#define IFX_GTM_MON_STATUS_ACT_CMU2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU2 */
#define IFX_GTM_MON_STATUS_ACT_CMU2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU2 */
#define IFX_GTM_MON_STATUS_ACT_CMU2_OFF (2)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU3 */
#define IFX_GTM_MON_STATUS_ACT_CMU3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU3 */
#define IFX_GTM_MON_STATUS_ACT_CMU3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU3 */
#define IFX_GTM_MON_STATUS_ACT_CMU3_OFF (3)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU4 */
#define IFX_GTM_MON_STATUS_ACT_CMU4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU4 */
#define IFX_GTM_MON_STATUS_ACT_CMU4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU4 */
#define IFX_GTM_MON_STATUS_ACT_CMU4_OFF (4)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU5 */
#define IFX_GTM_MON_STATUS_ACT_CMU5_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU5 */
#define IFX_GTM_MON_STATUS_ACT_CMU5_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU5 */
#define IFX_GTM_MON_STATUS_ACT_CMU5_OFF (5)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU6 */
#define IFX_GTM_MON_STATUS_ACT_CMU6_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU6 */
#define IFX_GTM_MON_STATUS_ACT_CMU6_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU6 */
#define IFX_GTM_MON_STATUS_ACT_CMU6_OFF (6)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMU7 */
#define IFX_GTM_MON_STATUS_ACT_CMU7_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMU7 */
#define IFX_GTM_MON_STATUS_ACT_CMU7_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMU7 */
#define IFX_GTM_MON_STATUS_ACT_CMU7_OFF (7)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX0 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX0_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX0 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX0 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX0_OFF (8)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX1 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX1_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX1 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX1_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX1 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX1_OFF (9)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX2 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX2_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX2 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX2_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX2 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX2_OFF (10)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX3 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX3_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX3 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX3_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX3 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX3_OFF (11)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX4 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX4_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX4 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX4_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.ACT_CMUFX4 */
#define IFX_GTM_MON_STATUS_ACT_CMUFX4_OFF (12)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.CMP_ERR */
#define IFX_GTM_MON_STATUS_CMP_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.CMP_ERR */
#define IFX_GTM_MON_STATUS_CMP_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.CMP_ERR */
#define IFX_GTM_MON_STATUS_CMP_ERR_OFF (16)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS0_ERR */
#define IFX_GTM_MON_STATUS_MCS0_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS0_ERR */
#define IFX_GTM_MON_STATUS_MCS0_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS0_ERR */
#define IFX_GTM_MON_STATUS_MCS0_ERR_OFF (20)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS1_ERR */
#define IFX_GTM_MON_STATUS_MCS1_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS1_ERR */
#define IFX_GTM_MON_STATUS_MCS1_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS1_ERR */
#define IFX_GTM_MON_STATUS_MCS1_ERR_OFF (21)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS2_ERR */
#define IFX_GTM_MON_STATUS_MCS2_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS2_ERR */
#define IFX_GTM_MON_STATUS_MCS2_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS2_ERR */
#define IFX_GTM_MON_STATUS_MCS2_ERR_OFF (22)

/** \\brief  Length for Ifx_GTM_MON_STATUS_Bits.MCS3_ERR */
#define IFX_GTM_MON_STATUS_MCS3_ERR_LEN (1)

/** \\brief  Mask for Ifx_GTM_MON_STATUS_Bits.MCS3_ERR */
#define IFX_GTM_MON_STATUS_MCS3_ERR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_MON_STATUS_Bits.MCS3_ERR */
#define IFX_GTM_MON_STATUS_MCS3_ERR_OFF (23)

/** \\brief  Length for Ifx_GTM_MSCIN_INHCON_Bits.SEL0 */
#define IFX_GTM_MSCIN_INHCON_SEL0_LEN (2)

