HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxGtm_bf.h
/** \\brief  Mask for Ifx_GTM_OTSC0_Bits.B1LMI */
#define IFX_GTM_OTSC0_B1LMI_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSC0_Bits.B1LMI */
#define IFX_GTM_OTSC0_B1LMI_OFF (20)

/** \\brief  Length for Ifx_GTM_OTSC0_Bits.B1LMT */
#define IFX_GTM_OTSC0_B1LMT_LEN (3)

/** \\brief  Mask for Ifx_GTM_OTSC0_Bits.B1LMT */
#define IFX_GTM_OTSC0_B1LMT_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_OTSC0_Bits.B1LMT */
#define IFX_GTM_OTSC0_B1LMT_OFF (16)

/** \\brief  Length for Ifx_GTM_OTSC1_Bits.MCS */
#define IFX_GTM_OTSC1_MCS_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSC1_Bits.MCS */
#define IFX_GTM_OTSC1_MCS_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSC1_Bits.MCS */
#define IFX_GTM_OTSC1_MCS_OFF (0)

/** \\brief  Length for Ifx_GTM_OTSC1_Bits.MI */
#define IFX_GTM_OTSC1_MI_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSC1_Bits.MI */
#define IFX_GTM_OTSC1_MI_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSC1_Bits.MI */
#define IFX_GTM_OTSC1_MI_OFF (4)

/** \\brief  Length for Ifx_GTM_OTSC1_Bits.MOE */
#define IFX_GTM_OTSC1_MOE_LEN (1)

/** \\brief  Mask for Ifx_GTM_OTSC1_Bits.MOE */
#define IFX_GTM_OTSC1_MOE_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_OTSC1_Bits.MOE */
#define IFX_GTM_OTSC1_MOE_OFF (9)

/** \\brief  Length for Ifx_GTM_OTSS_Bits.OTGB0 */
#define IFX_GTM_OTSS_OTGB0_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSS_Bits.OTGB0 */
#define IFX_GTM_OTSS_OTGB0_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSS_Bits.OTGB0 */
#define IFX_GTM_OTSS_OTGB0_OFF (0)

/** \\brief  Length for Ifx_GTM_OTSS_Bits.OTGB1 */
#define IFX_GTM_OTSS_OTGB1_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSS_Bits.OTGB1 */
#define IFX_GTM_OTSS_OTGB1_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSS_Bits.OTGB1 */
#define IFX_GTM_OTSS_OTGB1_OFF (8)

/** \\brief  Length for Ifx_GTM_OTSS_Bits.OTGB2 */
#define IFX_GTM_OTSS_OTGB2_LEN (4)

/** \\brief  Mask for Ifx_GTM_OTSS_Bits.OTGB2 */
#define IFX_GTM_OTSS_OTGB2_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_OTSS_Bits.OTGB2 */
#define IFX_GTM_OTSS_OTGB2_OFF (16)

/** \\brief  Length for Ifx_GTM_REV_Bits.DEV_CODE0 */
#define IFX_GTM_REV_DEV_CODE0_LEN (4)

/** \\brief  Mask for Ifx_GTM_REV_Bits.DEV_CODE0 */
#define IFX_GTM_REV_DEV_CODE0_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_REV_Bits.DEV_CODE0 */
#define IFX_GTM_REV_DEV_CODE0_OFF (20)

/** \\brief  Length for Ifx_GTM_REV_Bits.DEV_CODE1 */
#define IFX_GTM_REV_DEV_CODE1_LEN (4)

/** \\brief  Mask for Ifx_GTM_REV_Bits.DEV_CODE1 */
#define IFX_GTM_REV_DEV_CODE1_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_REV_Bits.DEV_CODE1 */
#define IFX_GTM_REV_DEV_CODE1_OFF (24)

/** \\brief  Length for Ifx_GTM_REV_Bits.DEV_CODE2 */
#define IFX_GTM_REV_DEV_CODE2_LEN (4)

/** \\brief  Mask for Ifx_GTM_REV_Bits.DEV_CODE2 */
#define IFX_GTM_REV_DEV_CODE2_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_REV_Bits.DEV_CODE2 */
#define IFX_GTM_REV_DEV_CODE2_OFF (28)

/** \\brief  Length for Ifx_GTM_REV_Bits.MAJOR */
#define IFX_GTM_REV_MAJOR_LEN (4)

/** \\brief  Mask for Ifx_GTM_REV_Bits.MAJOR */
#define IFX_GTM_REV_MAJOR_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_REV_Bits.MAJOR */
#define IFX_GTM_REV_MAJOR_OFF (16)

/** \\brief  Length for Ifx_GTM_REV_Bits.MINOR */
#define IFX_GTM_REV_MINOR_LEN (4)

/** \\brief  Mask for Ifx_GTM_REV_Bits.MINOR */
#define IFX_GTM_REV_MINOR_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_REV_Bits.MINOR */
#define IFX_GTM_REV_MINOR_OFF (12)

/** \\brief  Length for Ifx_GTM_REV_Bits.NO */
#define IFX_GTM_REV_NO_LEN (4)

/** \\brief  Mask for Ifx_GTM_REV_Bits.NO */
#define IFX_GTM_REV_NO_MSK (0xf)

/** \\brief  Offset for Ifx_GTM_REV_Bits.NO */
#define IFX_GTM_REV_NO_OFF (8)

/** \\brief  Length for Ifx_GTM_REV_Bits.STEP */
#define IFX_GTM_REV_STEP_LEN (8)

/** \\brief  Mask for Ifx_GTM_REV_Bits.STEP */
#define IFX_GTM_REV_STEP_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_REV_Bits.STEP */
#define IFX_GTM_REV_STEP_OFF (0)

/** \\brief  Length for Ifx_GTM_RST_Bits.RST */
#define IFX_GTM_RST_RST_LEN (1)

/** \\brief  Mask for Ifx_GTM_RST_Bits.RST */
#define IFX_GTM_RST_RST_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_RST_Bits.RST */
#define IFX_GTM_RST_RST_OFF (0)

/** \\brief  Length for Ifx_GTM_SPE_CMP_Bits.CMP */
#define IFX_GTM_SPE_CMP_CMP_LEN (24)

/** \\brief  Mask for Ifx_GTM_SPE_CMP_Bits.CMP */
#define IFX_GTM_SPE_CMP_CMP_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_SPE_CMP_Bits.CMP */
#define IFX_GTM_SPE_CMP_CMP_OFF (0)

/** \\brief  Length for Ifx_GTM_SPE_CNT_Bits.CNT */
#define IFX_GTM_SPE_CNT_CNT_LEN (24)

/** \\brief  Mask for Ifx_GTM_SPE_CNT_Bits.CNT */
#define IFX_GTM_SPE_CNT_CNT_MSK (0xffffff)

/** \\brief  Offset for Ifx_GTM_SPE_CNT_Bits.CNT */
#define IFX_GTM_SPE_CNT_CNT_OFF (0)

/** \\brief  Length for Ifx_GTM_SPE_CTRL_STAT_Bits.ADIR */
#define IFX_GTM_SPE_CTRL_STAT_ADIR_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.ADIR */
#define IFX_GTM_SPE_CTRL_STAT_ADIR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_CTRL_STAT_Bits.ADIR */
#define IFX_GTM_SPE_CTRL_STAT_ADIR_OFF (15)

/** \\brief  Length for Ifx_GTM_SPE_CTRL_STAT_Bits.AIP */
#define IFX_GTM_SPE_CTRL_STAT_AIP_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.AIP */
#define IFX_GTM_SPE_CTRL_STAT_AIP_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_CTRL_STAT_Bits.AIP */
#define IFX_GTM_SPE_CTRL_STAT_AIP_OFF (12)

/** \\brief  Length for Ifx_GTM_SPE_CTRL_STAT_Bits.FSOL */
#define IFX_GTM_SPE_CTRL_STAT_FSOL_LEN (8)

/** \\brief  Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.FSOL */
#define IFX_GTM_SPE_CTRL_STAT_FSOL_MSK (0xff)

/** \\brief  Offset for Ifx_GTM_SPE_CTRL_STAT_Bits.FSOL */
#define IFX_GTM_SPE_CTRL_STAT_FSOL_OFF (24)

/** \\brief  Length for Ifx_GTM_SPE_CTRL_STAT_Bits.FSOM */
#define IFX_GTM_SPE_CTRL_STAT_FSOM_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.FSOM */
#define IFX_GTM_SPE_CTRL_STAT_FSOM_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_CTRL_STAT_Bits.FSOM */
#define IFX_GTM_SPE_CTRL_STAT_FSOM_OFF (7)

/** \\brief  Length for Ifx_GTM_SPE_CTRL_STAT_Bits.NIP */
#define IFX_GTM_SPE_CTRL_STAT_NIP_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.NIP */
#define IFX_GTM_SPE_CTRL_STAT_NIP_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_CTRL_STAT_Bits.NIP */
#define IFX_GTM_SPE_CTRL_STAT_NIP_OFF (20)

/** \\brief  Length for Ifx_GTM_SPE_CTRL_STAT_Bits.PDIR */
#define IFX_GTM_SPE_CTRL_STAT_PDIR_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.PDIR */
#define IFX_GTM_SPE_CTRL_STAT_PDIR_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_CTRL_STAT_Bits.PDIR */
#define IFX_GTM_SPE_CTRL_STAT_PDIR_OFF (19)

/** \\brief  Length for Ifx_GTM_SPE_CTRL_STAT_Bits.PIP */
#define IFX_GTM_SPE_CTRL_STAT_PIP_LEN (3)

/** \\brief  Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.PIP */
#define IFX_GTM_SPE_CTRL_STAT_PIP_MSK (0x7)

/** \\brief  Offset for Ifx_GTM_SPE_CTRL_STAT_Bits.PIP */
#define IFX_GTM_SPE_CTRL_STAT_PIP_OFF (16)

/** \\brief  Length for Ifx_GTM_SPE_CTRL_STAT_Bits.SIE0 */
#define IFX_GTM_SPE_CTRL_STAT_SIE0_LEN (1)

/** \\brief  Mask for Ifx_GTM_SPE_CTRL_STAT_Bits.SIE0 */
#define IFX_GTM_SPE_CTRL_STAT_SIE0_MSK (0x1)

/** \\brief  Offset for Ifx_GTM_SPE_CTRL_STAT_Bits.SIE0 */
#define IFX_GTM_SPE_CTRL_STAT_SIE0_OFF (1)

/** \\brief  Length for Ifx_GTM_SPE_CTRL_STAT_Bits.SIE1 */
#define IFX_GTM_SPE_CTRL_STAT_SIE1_LEN (1)

